CSI API ETABS v1
cDesignSteel.GetSummaryResults_2 Method
 DEPRECATED ; refer to GetSummaryResults_3(String, Int32, String[], eFrameDesignOrientation[], String[], String[], String[], Double[], Double[], Double[], Double[], String[], Double[], String[], Double[], eItemType)
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSummaryResults_2(
	string Name,
	ref int NumberItems,
	ref string[] FrameType,
	ref string[] DesignSect,
	ref string[] Status,
	ref string[] PMMCombo,
	ref double[] PMMRatio,
	ref double[] PRatio,
	ref double[] MMajRatio,
	ref double[] MMinRatio,
	ref string[] VMajCombo,
	ref double[] VMajRatio,
	ref string[] VMinCombo,
	ref double[] VMinRatio,
	eItemType ItemType = eItemType.Objects
)
Function GetSummaryResults_2 (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef FrameType As String(),
	ByRef DesignSect As String(),
	ByRef Status As String(),
	ByRef PMMCombo As String(),
	ByRef PMMRatio As Double(),
	ByRef PRatio As Double(),
	ByRef MMajRatio As Double(),
	ByRef MMinRatio As Double(),
	ByRef VMajCombo As String(),
	ByRef VMajRatio As Double(),
	ByRef VMinCombo As String(),
	ByRef VMinRatio As Double(),
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cDesignSteel
Dim Name As String
Dim NumberItems As Integer
Dim FrameType As String()
Dim DesignSect As String()
Dim Status As String()
Dim PMMCombo As String()
Dim PMMRatio As Double()
Dim PRatio As Double()
Dim MMajRatio As Double()
Dim MMinRatio As Double()
Dim VMajCombo As String()
Dim VMajRatio As Double()
Dim VMinCombo As String()
Dim VMinRatio As Double()
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.GetSummaryResults_2(Name,
	NumberItems, FrameType, DesignSect,
	Status, PMMCombo, PMMRatio, PRatio,
	MMajRatio, MMinRatio, VMajCombo,
	VMajRatio, VMinCombo, VMinRatio,
	ItemType)
int GetSummaryResults_2(
	String^ Name,
	int% NumberItems,
	array<String^>^% FrameType,
	array<String^>^% DesignSect,
	array<String^>^% Status,
	array<String^>^% PMMCombo,
	array<double>^% PMMRatio,
	array<double>^% PRatio,
	array<double>^% MMajRatio,
	array<double>^% MMinRatio,
	array<String^>^% VMajCombo,
	array<double>^% VMajRatio,
	array<String^>^% VMinCombo,
	array<double>^% VMinRatio,
	eItemType ItemType = eItemType::Objects
)
abstract GetSummaryResults_2 :
        Name : string *
        NumberItems : int byref *
        FrameType : string[] byref *
        DesignSect : string[] byref *
        Status : string[] byref *
        PMMCombo : string[] byref *
        PMMRatio : float[] byref *
        PRatio : float[] byref *
        MMajRatio : float[] byref *
        MMinRatio : float[] byref *
        VMajCombo : string[] byref *
        VMajRatio : float[] byref *
        VMinCombo : string[] byref *
        VMinRatio : float[] byref *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
NumberItems
Type: System.Int32
FrameType
Type: System.String[]
DesignSect
Type: System.String[]
Status
Type: System.String[]
PMMCombo
Type: System.String[]
PMMRatio
Type: System.Double[]
PRatio
Type: System.Double[]
MMajRatio
Type: System.Double[]
MMinRatio
Type: System.Double[]
VMajCombo
Type: System.String[]
VMajRatio
Type: System.Double[]
VMinCombo
Type: System.String[]
VMinRatio
Type: System.Double[]
ItemType (Optional)
Type: ETABSv1.eItemType
Return Value
Type: Int32
See Also
Reference
cDesignSteel Interface
ETABSv1 Namespace